docs/custom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42/hp42s/DM42 Custom Menus</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Making Custom Menus for the free42/hp-42s/DM42"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://www.mitchr.me/FIXME"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42/hp42s/DM42 Custom Menus</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-03-28 11:02:42</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35b2091">1. Metadata</a></li>
<li><a href="#orgbee3228">2. Introduction</a>
<ul>
<li><a href="#orgf7ab358">2.1. Customizing Custom Menu Table</a></li>
</ul>
</li>
<li><a href="#org4afba84">3. Custom Menu</a>
<ul>
<li><a href="#org946a597">3.1. Menu Contents</a></li>
<li><a href="#orgcb017ca">3.2. Menu Code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org35b2091" class="outline-2">
<h2 id="org35b2091"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
This home for this HTML file is: <a href="https://richmit.github.io/hp42/custom.html">https://richmit.github.io/hp42/custom.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<ul class="org-ul">
<li><code>src</code> directory: Contains the org-mode file that generated this HTML document</li>
<li><code>docs</code> directory: Contains this html document</li>
<li><code>bin</code> directory: Contains raw program files</li>
</ul>
</div>
</div>

<div id="outline-container-orgbee3228" class="outline-2">
<h2 id="orgbee3228"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
The custom menu on the 42s is a wonderful thing, but it is also very limited.  It's just too small!!  And it is only one level deep!!  So instead of simply
assigning functions to the menu keys, how about assigning programs to the keys which present a hierarchical menu of functions?  Coding up such programs is
tedious.  So this org-mode document has a Little bit of Emacs lisp that will consume a table, and generate a 42s program implementing a hierarchical menu.
</p>

<p>
The flow to create your custom CUST program:
</p>
<ul class="org-ul">
<li>Evaluate the "Generic menu generator" babel block in the <code>hp42s-meta.org</code> file.  This will define the function <code>MJR-generate-42-menu-code</code></li>
<li>Evaluate the "For CUSTOM-type Menus" babel block in the <code>hp42s-meta.org</code> file.  This will define the function <code>MJR-custom-x-gen</code></li>
<li>Define your menu in the <a href="#org946a597">Menu Contents</a> section.</li>
<li>Evaluate the babel block in the <a href="#orgcb017ca">Menu Code</a> section below.</li>
<li>Load the program on your calculator</li>
</ul>
</div>

<div id="outline-container-orgf7ab358" class="outline-3">
<h3 id="orgf7ab358"><span class="section-number-3">2.1</span> Customizing Custom Menu Table</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The first column (which I labeled Menu) describes the menu keys.  Colons are used to define a menu hierarchy.  For example "<code>top:mid:thingy</code>" means we have a
top level menu "<code>top</code>" containing a menu "<code>mid</code>" containing a function/program "<code>thingy</code>".  Another entry like "<code>top:thingy2</code>" would add a function/program
key "<code>thingy2</code>"to the "<code>top</code>" menu &#x2013; yes menus can contain a mix of functions/programs and menus.
</p>

<p>
The only limitation on menu hierarchy depth or size comes from the use of two digit local labels in the generated code.  A label is consume for each
function/program and for each menu page.
</p>

<p>
The second column is the function/program name/label to call.  If this is empty, then the menu name will be used.  For example "<code>SFUN:HYP:SINH</code>" will call the
<code>SINH</code> function if no Program is specified.
</p>

<p>
The other columns of the table are not used.
</p>
</div>
</div>
</div>
