src/custom.org
** Menu Contents

#+ATTR_HTML: :rules all :frame box :align center
#+NAME: custom
| Menu           | Function/Program |                                          |
|----------------+------------------+------------------------------------------|
| SFUN:HYP:SINH  |                  |                                          |
| SFUN:HYP:COSH  |                  |                                          |
| SFUN:HYP:TANH  |                  |                                          |
| SFUN:HYP:ASINH |                  |                                          |
| SFUN:HYP:ACOSH |                  |                                          |
| SFUN:HYP:ATANH |                  |                                          |
|----------------+------------------+------------------------------------------|
| SFUN:L&P:lnYX  |                  | https://richmit.github.io/hp42/math.html |
| SFUN:L&P:ln2   |                  | https://richmit.github.io/hp42/math.html |
| SFUN:L&P:2↑X   |                  | https://richmit.github.io/hp42/math.html |
| SFUN:L&P:YROOT |                  | https://richmit.github.io/hp42/math.html |
|----------------+------------------+------------------------------------------|
| SFUN:PERC:%T   |                  | https://richmit.github.io/hp42/math.html |
| SFUN:PERC:%CH  |                  |                                          |
| SFUN:PERC:%    |                  |                                          |
|----------------+------------------+------------------------------------------|
| SFUN:PROB:COMB |                  |                                          |
| SFUN:PROB:PERM |                  |                                          |
| SFUN:PROB:!    |                  |                                          |
|----------------+------------------+------------------------------------------|
| SFUN:INT:IDIV  | BASE÷            |                                          |
| SFUN:INT:MOD   |                  |                                          |
| SFUN:INT:GCD   |                  | https://richmit.github.io/hp42/math.html |
| SFUN:INT:LCM   |                  | https://richmit.github.io/hp42/math.html |
|----------------+------------------+------------------------------------------|
| DATE:DATE      | IDATE            | https://richmit.github.io/hp42/date.html |
| DATE:TIME      | ITIME            | https://richmit.github.io/hp42/date.html |
| DATE:UTIME     |                  | https://richmit.github.io/hp42/date.html |
| DATE:          |                  |                                          |
| DATE:DT→U      |                  | https://richmit.github.io/hp42/date.html |
| DATE:U→DT      |                  | https://richmit.github.io/hp42/date.html |
|----------------+------------------+------------------------------------------|
| DATE:DATE+     | IDATE+           | https://richmit.github.io/hp42/date.html |
| DATE:DDAYS     |                  |                                          |
| DATE:DOW       | IDOW             | https://richmit.github.io/hp42/date.html |
| DATE:          |                  |                                          |
| DATE:          |                  |                                          |
| DATE:          |                  |                                          |
|----------------+------------------+------------------------------------------|
| PHIL:PERF      |                  | https://richmit.github.io/hp42/phil.html |
| PHIL:IMET      |                  | https://richmit.github.io/hp42/phil.html |
| PHIL:MEAS      |                  | https://richmit.github.io/hp42/meas.html |
|----------------+------------------+------------------------------------------|
| BASE           |                  | https://richmit.github.io/hp42/base.html |
| CONS           |                  | https://richmit.github.io/hp42/cons.html |
| UNIT           |                  | https://richmit.github.io/hp42/unit.html |
| MEAS           |                  | https://richmit.github.io/hp42/meas.html |
|----------------+------------------+------------------------------------------|

