docs/custom.html

<div id="outline-container-org4afba84" class="outline-2">
<h2 id="org4afba84"><span class="section-number-2">3</span> Custom Menu</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org946a597" class="outline-3">
<h3 id="org946a597"><span class="section-number-3">3.1</span> Menu Contents</h3>
<div class="outline-text-3" id="text-3-1">
<table id="org01f675a" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Function/Program</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SFUN:HYP:SINH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:HYP:COSH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:HYP:TANH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:HYP:ASINH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:HYP:ACOSH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:HYP:ATANH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SFUN:L&amp;P:lnYX</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>

<tr>
<td class="org-left">SFUN:L&amp;P:ln2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>

<tr>
<td class="org-left">SFUN:L&amp;P:2↑X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>

<tr>
<td class="org-left">SFUN:L&amp;P:YROOT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SFUN:PERC:%T</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>

<tr>
<td class="org-left">SFUN:PERC:%CH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:PERC:%</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SFUN:PROB:COMB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:PROB:PERM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:PROB:!</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SFUN:INT:IDIV</td>
<td class="org-left">BASE÷</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:INT:MOD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SFUN:INT:GCD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>

<tr>
<td class="org-left">SFUN:INT:LCM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DATE:DATE</td>
<td class="org-left">IDATE</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:TIME</td>
<td class="org-left">ITIME</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:UTIME</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DATE:DT→U</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:U→DT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DATE:DATE+</td>
<td class="org-left">IDATE+</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:DDAYS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DATE:DOW</td>
<td class="org-left">IDOW</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/date.html">https://richmit.github.io/hp42/date.html</a></td>
</tr>

<tr>
<td class="org-left">DATE:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DATE:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DATE:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PHIL:PERF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/phil.html">https://richmit.github.io/hp42/phil.html</a></td>
</tr>

<tr>
<td class="org-left">PHIL:IMET</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/phil.html">https://richmit.github.io/hp42/phil.html</a></td>
</tr>

<tr>
<td class="org-left">PHIL:MEAS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/meas.html">https://richmit.github.io/hp42/meas.html</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">BASE</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/base.html">https://richmit.github.io/hp42/base.html</a></td>
</tr>

<tr>
<td class="org-left">CONS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/cons.html">https://richmit.github.io/hp42/cons.html</a></td>
</tr>

<tr>
<td class="org-left">UNIT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/unit.html">https://richmit.github.io/hp42/unit.html</a></td>
</tr>

<tr>
<td class="org-left">MEAS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://richmit.github.io/hp42/meas.html">https://richmit.github.io/hp42/meas.html</a></td>
</tr>
</tbody>
</table>
</div>
</div>
